#include<stdio.h>
int main(void)
{
	int x[7];   //用来存放原来哥兄弟得到的苹果数；
	int y[7];   //用来存放得到哥哥或弟弟的苹果后的苹果总数；
	int s, i;
	s = 2520 / 6;   //求出每个人平均要分多少苹果；
	for (i = 2; i <= 6; i++)  
		y[i] = s*(9 - i) / (8-i);   //求出老二到老六原来每得到哥哥分来的苹果却未分给弟弟的苹果数；
	y[1] = x[1] = (8 / 7)*(s - 1 / 3 * y[6]);    //老大得到老六分来的苹果却为分给弟弟的苹果；
	for (i = 2; i <= 6; i++)
		x[i] = y[i] - y[i - 1] /(10 - i);     //求出原来每个人的苹果个数；
	for (i = 1; i <= 6; i++)
		printf("y[%d]=%d\n",i,x[i]);
	puts("");
	for (i = 1; i <= 6; i++)
		printf("x[%d]=%d    ", i, y[i]);
	puts("");
















	return 0;
}